Add legacy and v2 authority providers
Add legacy and v2 authority providers
